bench/baseline/wrk_vs_oha_w6_v1.txt
== granian w6: warmup
== granian w6: wrk -t4 -c256 -d10s
Running 10s test @ http://127.0.0.1:8123/
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.65ms    1.11ms  31.63ms   90.72%
    Req/Sec    40.00k     3.45k   53.62k    75.74%
  1608622 requests in 10.11s, 230.12MB read
Requests/sec: 159170.36
Transfer/sec:     22.77MB
== granian w6: wrk -t8 -c512 -d10s
Running 10s test @ http://127.0.0.1:8123/
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.53ms    2.90ms  46.47ms   89.77%
    Req/Sec    20.27k     1.32k   24.45k    71.87%
  1627605 requests in 10.10s, 232.83MB read
Requests/sec: 161086.25
Transfer/sec:     23.04MB
== granian w6: oha -c256 -z10s
  Success rate:	100.00%
  Requests/sec:	140046.6123
  99.00% in 7.8832 ms
== uvicorn w6: wrk -t4 -c256 -d10s
Running 10s test @ http://127.0.0.1:8123/
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.41ms  561.38us  14.79ms   84.17%
    Req/Sec    44.12k     3.27k   48.19k    85.75%
  1755881 requests in 10.00s, 251.18MB read
Requests/sec: 175557.24
Transfer/sec:     25.11MB
done